#-------------------------------------------------------------------------------
#Движение черепахи
#-------------------------------------------------------------------------------
# Импорт библиотеки
from turtle import *

simvol=" "



# Запрашиваем команду
simvol=input("Введите строку команд :") # считать через input()
print(simvol)
# Обработать и построить

shape ('arrow')
screensize(800,800)
color('green')
pensize(3)
speed('slow')



for i in simvol: # пробежать всю строку simvol по элементам i

   if i=='l': left(1) # повернуть на 1 градус влево
   if i=='r': right(1) # или вправо
   if i=='g': forward(1) # сдвитуться вперёд



done()