#-------------------------------------------------------------------------------
# Name:     Р С›Р С”РЎР‚РЎС“Р В¶Р Р…Р С•РЎРѓРЎвЂљР С‘
# Purpose:

#
# Author:      Р В§Р ВµРЎР‚Р Р…РЎРЏР ВµР Р† Р вЂ™Р В°Р В»Р ВµР Р…РЎвЂљР С‘Р Р…
#
# Created:     20.09.2016
# Copyright:   (c) Р В§Р ВµРЎР‚Р Р…РЎРЏР ВµР Р† Р вЂ™Р В°Р В»Р ВµР Р…РЎвЂљР С‘Р Р… 2016
# Licence:     <your licence>
#-------------------------------------------------------------------------------
n=int(input())

import turtle as t
t.speed(2)
t.right(90)
t.penup()
t.pendown()
for i in range (1, n+1):
    t.shape("turtle")
    t.circle(30*i, 360)
    t.circle(-30*i, 360)
t.mainloop()
t.done()